import React from 'react';
import Card from '../Card/Card';
// import data from '../data';

import '../../style/App.css';
import '../../style/Card.css'

const heroes = [{
  id: "Бэтмен",
  alterego: "Брюс Уэйн",
  universe: "DC Comics",
  occupation: "борец с преступностью, филантроп, миллиардер",
  ally: "Робин, Бэтгерл",
  enemy: "Джокер",
  powers: "богатство, интеллект, обширные познания, знания боевых искусств, ловкость",
  quote: "I am vengeance, I am justice, I am the night. . . I AM BATMAN!",
  img: "assets/img/batman.jpg",
  info: "по популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом."
}, {
  id: "Супермен",
  alterego: "Кларк Кент",
  universe: "DC Comics",
  occupation: "супергерой, борец за справедливость, журналист",
  ally: "Бэтмен, Чудо-женщина",
  enemy: "Лекс Лютор",
  powers: "неуязвимость, сверхсила, полет, самоисцеление, суперзрение и суперслух",
  quote: "Dreams lift us up and transform is into something better",
  img: "assets/img/superman.jpg",
  info: "полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена. Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к криптониту, радиоактивному веществу с родной планеты."
}, {
  id: "Чудо-женщина",
  alterego: "Принцесса Диана из Темискиры",
  universe: "DC Comics",
  occupation: "принцесса амазонок, секретарь-референт",
  ally: "Бэтмен, Супермен",
  enemy: "Арес",
  powers: "cверхчеловеческая сила, скорость, выносливость, ловкость и стойкость",
  quote: "Now I know, that only love can truly save the world",
  img: "assets/img/wonderwoman.jpg",
  info: "принцесса-амазонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Свое настоящее имя — Диана — она получила в честь древнегреческой богини охоты, а суперспособности — от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма. У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. "
}, {
  id: "Железный человек",
  alterego: "Тони Старк', 'Marvel Comics",
  universe: "Marvel Comics",
  occupation: "гений, миллиардер, плейбой, филантроп",
  ally: "Мстители",
  enemy: "Читаури, Танос и другие",
  powers: "высокий уровень интеллекта, широкие познания в науке и технике, широкий доступ к сверхсовременным технологиям",
  quote: "I am Iron Man",
  img: "assets/img/ironman.jpg",
  info: "пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Прототипом для героя послужил изобретатель Говард Хьюз.Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
}, {
  id: "Человек-паук",
  alterego: "Питер Паркер",
  universe: "Marvel Comics",
  occupation: "борец за справедливость, студент, фотограф",
  ally: "Мстители",
  enemy: "Норман Осборн, Доктор Осьминог",
  powers: "сверхчеловеческие рефлексы, «паучье чутье», способность прилепляться к твердым поверхностям, производство паутины",
  quote: "With great power comes great responsibility",
  img: "assets/img/spidy.jpg",
  info: "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка.  Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность»."
}, {
  id: "Халк",
  alterego: "Брюс Беннер",
  universe: "Marvel Comics",
  occupation: "супергерой, борец за справедливость, ученый-биохимик",
  ally: "Железный человек, Капитан Америка",
  enemy: "Читаури, Танос и другие",
  powers: "сверхчеловеческая сила искорость, выносливость, полет",
  quote: "Hulk smash!",
  img: "assets/img/hulk.jpg",
  info: "идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев.   Пронеся через все детство тяжелый психологический груз, Брюс вырос в чрезвычайно одаренного, но замкнутого юношу. Хотя Брюс не мог уважать отца, но пошел в науке по его стопам и выбрал ядерную физику. Во время эксперимента он ввел себе пробную сыворотку и подверг себя воздействию большого количества гамма-радиации. Беннер превратился в мускулистого неуправляемого гиганта, который крушил все вокруг и не понимал, что происходит. Так имя Халка стало нарицательным для людей, который не могут держать себя в руках."
}, {
  id: "Черная вдова",
  alterego: "Наташа Романофф",
  universe: "Marvel Comics",
  occupation: "супергероиня, шпионка",
  ally: "Мстители",
  enemy: "Танос, скруллы",
  powers: "пик человеческого физического потенциала, замедленное старение, знание многих языков",
  quote: "I'm always picking up after you, boys...",
  img: "assets/img/widow.jpg",
  info: "супергероиня российского происхождения родилась предположительно в 1928 году в Сталинграде. Во время Второй мировой войны она потеряла родителей и была спасена из горящего дома советским солдатом. Тот на некоторое время стал ее опекуном. Повзрослев, Наташа попала в организацию «Красная Комната», где прошла многочисленные тренировки, а именно — была частью шпионской программы. Там же ей вживили сыворотку Суперсолдата — как у Капитана Америки, но в советском варианте. Благодаря ей Наташа может использовать максимальные возможности своего организма: силу, гибкость, скорость, ловкость и т. д. Также сыворотка дает эффект замедленного старения."
}];


function App() {
  return ( <div className = "App" > {
      heroes.map((hero) =>
        <Card key = {hero.id} img = {hero.img} id = {hero.id} quote = {hero.quote} alterego = {hero.alterego}universe = {hero.universe} occupation = {hero.occupation} ally = {hero.ally} enemy = {hero.enemy}powers = {hero.powers} info = {hero.info}> </Card>)
      } </div>
    );
  }

  export default App;